In [45]:
import pandas as pd

my_dict = {
    "a": 1,
    "b": 2,
    "c": 3
    }
# print(my_dict)

# print(my_dict.keys())

# print(list(my_dict.keys()))

# print(my_dict.values())

# print(list(my_dict.values()))

# for key, value in my_dict.items():
#     print(f"Key {key} : Value {value}")

# data_dict = {'a': 1, 'b': 2, 'c': 3}
# series_dict = pd.Series(data_dict)
# print(series_dict)

# data = [10,20,30]
# index = ['a', 'b', 'c']
# series_custom = pd.Series(data, index=index)
# print(series_custom)

data = {
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, 35],
    'city': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

df.to_excel('output.xlsx', index=False)

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [ ]:
data = [
    {'name': 'Alice', 'age': 25, 'city': 'New York'},
    {'name': 'Bob', 'age': 30, 'city': 'Los Angeles'},
    {'name': 'Charlie', 'age': 35, 'city': 'Chicago'}
]

df = pd.DataFrame(data)
# print(df)

# df.tail(1)  # Display the first few rows of the DataFrame

# df[['name','age','city']]  # Access a specific column by name

# df

# df[df.age > 30]  # Filter rows based on a condition

e1 = df.iloc[0:1]  # Access a specific cell by row and column labels

# print(e1)  # Print the value of the accessed cell

# print(df)

# e2 = df.iloc[0, 0]
# print(e2)  # Print the value of the accessed cell

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
Alice

In [83]:
df

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [82]:
df.iloc[[0,1],[0,2]]

    name         city
0  Alice     New York
1    Bob  Los Angeles

In [86]:
e3 = df.iat[1, 0]
print(e3)  # Print the value of the accessed cell

Bob

In [99]:
df1 = pd.read_csv('100 Sales Records.csv',encoding='utf-8');
df1  # Display the first few rows of the DataFrame

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,Sub-Saharan Africa,Mali,Clothes,Online,M,7/26/2011,512878119,9/3/2011,888,109.28,35.84,97040.64,31825.92,65214.72
96,Asia,Malaysia,Fruits,Offline,L,11/11/2011,810711038,12/28/2011,6267,9.33,6.92,58471.11,43367.64,15103.47
97,Sub-Saharan Africa,Sierra Leone,Vegetables,Offline,C,6/1/2016,728815257,6/29/2016,1485,154.06,90.93,228779.10,135031.05,93748.05
98,North America,Mexico,Personal Care,Offline,M,7/30/2015,559427106,8/8/2015,5767,81.73,56.67,471336.91,326815.89,144521.02
99,Sub-Saharan Africa,Mozambique,Household,Offline,L,2/10/2012,665095412,2/15/2012,5367,668.27,502.54,3586605.09,2697132.18,889472.91